# WattsPerSquareMeterKelvin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..WattsPerSquareMeterKelvin Property
UnitTypeId Class See Also
---
Watts per square meter kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WattsPerSquareMeterKelvin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WattsPerSquareMeterKelvin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WattsPerSquareMeterKelvin {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace